#include <iostream>

int main() {
    int t = 0;
    int n = 0;
    std::cin >> t;
    std::string s = "";
    for (int i = 0; i < t; i += 1) {
        std::cin >> n;
        int x1 = 0;
        int y1 = 0;
        int x2 = 0;
        int y2 = 0;
        int x3 = 0;
        int y3 = 0;
        int x4 = 0;
        int y4 = 0;
        int fl = 0;
        for (int j = 0; j < n; j += 1) {
            std::cin >> s;
            for (int k = 0; k < n; k += 1) {
                if (s[k] == '*' && fl == 0) {
                    x1 = k + 1; // k - номер столбца
                    y1 = j + 1; // j - номер строки
                    fl = 1;
                }
                else if (s[k] == '*' && fl == 1) {
                    x2 = k + 1; // k - номер столбца
                    y2 = j + 1; // j - номер строки
                }
            }
        }
        if (x1 != x2 && y1 != y2) { // если точки не находятся ни в одной линии, ни в одной строке
            x3 = x2; // точка находится в том же столбце, что и вторая
            y3 = y1; // точка находится в той же строке, что и первая
            x4 = x1;
            y4 = y2;
        }
        else if (x1 == x2) { // если точки на одном столбце
            if (x1 == 1) {
                x3 = 2;
                x4 = 2;
            } // самая левая или правая возможная точка
            else {
                x3 = 1;
                x4 = 1;
            }
            y3 = y1; // на той же строке, что и первая
            y4 = y2; // на той же строке, что и вторая
        }
        else if (y1 == y2) { // если точки на одной строке
            if (y1 == 1) {
                y3 = 2;
                y4 = 2;
            } // самая левая или правая возможная точка
            else {
                y3 = 1;
                y4 = 1;
            }
            x3 = x2; // на том же столбце, что и вторая
            x4 = x1; // на том же столбце, что и первая
        }
        for (int j = 0; j < n; j += 1) {
            for (int k = 0; k < n; k += 1) {
                if (k + 1 == x3 && j + 1 == y3) {
                    std::cout << '*';
                    x3 = -1;
                    y3 = -1;
                }
                else if (k + 1 == x1 && j + 1 == y1) {
                    std::cout << '*';
                    x1 = -1;
                    y1 = -1;
                }
                else if (k + 1 == x4 && j + 1 == y4) {
                    std::cout << '*';
                    x4 = -1;
                    y4 = -1;
                }
                else if (k + 1 == x2 && j + 1 == y2) {
                    std::cout << '*';
                    x2 = -2;
                    y2 = -2;
                }
                else {
                    std::cout << '.';
                }
            }
            std::cout << std::endl;
        }
    }
}
